[{"nombre_artista":"dead prez","oyentes":"576772","reproducciones":"7899568","bio":"Dead Prez are an underground hip-hop duo which formed in 1996 in New York City, New York, United States, consisting of rapper stic.man and M-1. They have released three albums, \"Let's Get Free\" (2000),  \"Revolutionary But Gangsta\" (2004), and \"Information Age\" (2012). The duo has also released several mixtapes.\n\nThey are known for their sometimes confrontational style, combined with socialist lyrics focused on both militant social justice, and also positivity. The duo maintains an ethical stance against corporate control over the media, especially hip-hop record labels. <a href=\"https:\/\/www.last.fm\/music\/dead+prez\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":["The Coup","Immortal Technique","Talib Kweli","Black Star","Reflection Eternal"]},{"nombre_artista":"Static-X","oyentes":"1556611","reproducciones":"44952291","bio":"Static-X was formed in 1994 from the ashes of Wayne Static and Ken Jay's former band, Deep Blue Dream. After searching for members in Chicago, IL, Static and Jay decided to go to Los Angeles to continue their search. There they met Tony Campos from the Mexican death metal band Asesino, and Koichi Fukuda, completing the band's original line-up. Static-X signed with Warner Brothers Records in early 1998.\n\nThe band's debut album, Wisconsin Death Trip, was released March 23, 1999. Notable songs from the album include Push It, I'm With Stupid, Bled For Days, and Fix. Static-X's touring schedule in support of the album included two Ozzfest stints. The following year saw the release of the little-known EP The Death Trip Continues, and the band contributed the song \"Otsegolation\" to the PlayStation video game Omega Boost. Push It also appeared on the Playstation video games Street Skater 2 & Duke Nukem: Land of the Babes.\n\nAfter recording their follow-up album Machine, guitarist Koichi Fukuda left the band to spend time with his family and pursue other musical opportunities. Tripp Eisen, formerly of Dope, stepped in as Fukuda's replacement. Machine was released May 22, 2001.\n\nStatic-X quickly began work on their third album Shadow Zone, this time with Eisen performing and writing on the album. Before they started recording, however, Ken Jay left the band due to \"political differences.\" Josh Freese of A Perfect Circle was brought in to drum on the album, and Nick Oshiro, formerly of Seether, was later selected as Jay's replacement. Shadow Zone was released October 7, 2003, and July 20, 2004 saw the release of Beneath... Between... Beyond..., a collection of rarities and demos. Later that year, Wayne did guest vocals on the Skinny Puppy song Use Less.\n\nShortly after the release of Beneath... Between... Beyond..., the band commenced work on their fourth studio album, Start a War. In February of 2005, Tripp Eisen was arrested in a sex scandal involving minors, and was fired from Static-X shortly after. Former guitarist Koichi Fukuda, who had been mixing the new album, rejoined Static-X to fill the vacancy left by Eisen. Start a War was released June 14, 2005.\n\nCannibal, released on April 3, 2007, marked the studio return of their original guitarist, Koichi Fukuda. One of the new tracks called \"No Submission\" is available on the Saw III soundtrack. The full track has also been released on Static-X's MySpace page. \"Cannibal\" was released as a digital download single at iTunes. \"Destroyer\" was released as a lead off radio single, before the album was released. Videos for the singles were supposed to be taken at the same time.\n\nOn March 20, the upcoming album was preceded with an exclusive Destroyer EP. The video for \"Destroyer\" has also been produced and is available now at headbangersball.com. The album itself debuted at #36 in the U.S. with sales of over 30,000.\n\nOn May 10, 2007 it was announced that the band would be playing on the main stage at Ozzfest 2007. Additionally, in a recent interview, Wayne Static announced his side-project called \"Pighammer\". The chorus of the song \"Destroyer\" was used in an advertisement promoting the latest video game in the WWE franchise, Smackdown vs. Raw 2008.\n\nIn November 2007, Tony Campos joined legendary industrial act Ministry as a temporary touring bassist for Ministry's C U LaTour in the wake of Paul Raven's death.\n\nThe band began their sixth studio album, Cult of Static, in January 2008 after returning from the Operation Annihilation tour in Australia. In a posting at the Static-X message boards Wayne Static said that this time around he is focusing on longer buildups and break downs like in the Wisconsin Death Trip days of the band, however the album still maintains the heaviness that was present on Cannibal.\n\nOn October 14, 2008 Static-X released their much anticipated live CD\/DVD, Cannibal Killers Live. On December 11, 2008 Wayne Static confirmed on the Static-X Message Board the new album's release date and name saying \"I had hoped to announce it here first, but my publicist beat me to the punch! The new record is indeed entitled \"Cult of Static\" and will be released March 17. The \"cult\" part of the title is not to be taken in any religious manner, I am referring to and giving respect to the loyalty of all you good people that have supported us through the years. This record is definitely darker than Cannibal and has more synths and loops as well. And this is also the most crushing guitar tone I have ever had. There are 11 songs instead of our usual 12, and they are mostly longer and more epic than ever before.\" The album debut at #16 on the Billboard 200 chart, the highest a Static-X album has ever been since their second studio album, Machine.  A new Static-X song called \"Lunatic\" appeared on soundtrack to the movie Punisher: War Zone.\n\nIn 2009, the band performed at the Download Festival. It also was the first time the band made an appearance at Rock on the Range.After finishing their final tour dates in Australia at the end of 2009, Wayne Static announced on the band's official X-Boards that he will now be focusing on his side project Pighammer. In a follow up post he was quoted \"It's doubtful I will do anything with Static-X for the next couple years\" leading fans to interpret that the band is still together and just on hiatus.\n\nLater, he revealed that Tony Campos had left the band, and Campos has since joined the metal band Soulfly, taking over from Bobby Burns. Koichi Fukuda went on to join industrial metal \/ ambient band Drugstore Fanatics.\n\nIn 2010, Wayne Static has been confirmed for Graspop Metal Meeting 2011 as part of his 'Pighammer' solo project. He released his debut solo album \"Pighammer on October 4, 2011.\n\nIn 2012 Wayne Static decided to reform Static-X, but none of the original members will join him. Instead his solo band will tour under the name Static-X.\n\nThe band's musical styles are industrial metal, alternative metal, and occasionally nu metal. But the band rejected the nu metal label and they also call their music as \"evil disco\". The band are influenced by metal and industrial bands like Ministry and Fear Factory.\n\nOn 1st of November 2014, news surfaced of Wayne Static's death. At this point no formal reason has been published for his passing. \nStatic died on November 1, 2014 in Landers, California, three days before his 49th birthday. He had consumed half of an oxycodone pill as well as alcohol that morning before going to bed with his wife Tera Wray. She woke up later that day to find that he had died in his sleep. His family issued a statement stating that rumors of his death being drug-related were false, noting that he and Wray had stopped using illicit drugs in 2009. An autopsy later confirmed that Static had died of multiple prescription drug toxicity, consisting of the painkillers oxycodone, hydromorphone, and the anti-anxiety medication alprazolam combined with alcohol, though the report also noted that years of past \"chronic prescription drug and alcohol abuse\" was a contributing factor.\n\nFormer Static-X members Koichi Fukuda and Tony Campos paid tribute to Static. Static was cremated in California. A memorial rock show followed in Los Angeles, and a family service followed in Illinois. In 2019 it was announced that a new Static-X album would be coming out with a new lead singer named \"Xer0\", who is rumored to be Edsel Dope from the band Dope.\n\nStatic-X released an album titled “Project Regeneration Vol. 1” on July 10, 2020 that features completed tracks that use demos of Wayne’s voice. The original band lineup, minus Wayne Static, contributed to this album as a tribute to Wayne. There are a few songs with the entity, Xer0, involved and one featuring Al Jourgensen from the industrial metal band Ministry. Ulrich Wild returned to produce this album along with Edsel Dope.\n\nAfter multiple pushed back dates, another album called “Project Regeneration Vol. 2” was released on January 26, 2024. It features the last of Wayne’s unfinished vocal demos as well as some Xer0 original tracks. This is the final volume of Project Regeneration.\n\nMembers\nXero – vocals, lead guitar (2019-present)\nTony Campos – bass, backing vocals (1994–present)\nKoichi Fukuda – lead guitars (1994–2000, 2005–present)\nKen Jay – drums, percussion (1994–2002, 2019-present)\n\nFormer\nWayne Static – lead vocals, rhythm guitars, keyboards, programming (1994–2014)\nAshes – lead guitars (2012–2014)\nBrent Ashley – bass (2012–2014)\nSean Davidson – drums, percussion (2012–2014)\nTripp Eisen – lead guitars (2001–2005)\nNick Oshiro – drums, percussion (2003–2012) <a href=\"https:\/\/www.last.fm\/music\/Static-X\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":["Wayne Static","Dope","Coal Chamber","Powerman 5000","Spineshank"]},{"nombre_artista":"Souchi","oyentes":"3187","reproducciones":"28566","bio":"","similares":["Morodo 1","Ganja Party","la jet set conexion","Souchi Con Morodo","Morodo + BDF Ft Roberto Sanche"]},{"nombre_artista":"Up, Bustle & Out","oyentes":"78540","reproducciones":"764150","bio":"Name variation for Up, Bustle and Out <a href=\"https:\/\/www.last.fm\/music\/+noredirect\/Up,+Bustle+&+Out\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":[]},{"nombre_artista":"Selektah Kolektiboa","oyentes":"1422","reproducciones":"16486","bio":"Selektah Kolektiboa is a music group and, at the same time, an open-ended project aimed at making black music, with its myriad of faces and styles. Apart from organisation of fiestas and working as a sound system, it is the pioneering group for hip-hop in Basque. <a href=\"https:\/\/www.last.fm\/music\/Selektah+Kolektiboa\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":["Lin Ton Taun","Kashbad","Beti Mugan","EH Sukarra","Fermin Muguruza Eta Dut"]},{"nombre_artista":"Lords of the Underground","oyentes":"265630","reproducciones":"2472665","bio":"The Lords of the Underground (L.O.T.U.G.) is a hip-hop trio based in Newark, New Jersey. MCs Mr. Funke and DoItAll Dupré met DJ Lord Jazz (a native of Cleveland) when all three were undergraduates at Shaw University[citation needed]. Fellow New Jersey rapper Redman served as one of the group's early DJ's.\n\nThe group released their debut album, Here Come the Lords on March 9, 1993 with production handled by Marley Marl and K-Def. The album peaked at 66 on the Billboard 200 and featured five charting singles, including the group's signature song, \"Chief Rocka\".\n\nThe group released their second album, Keepers of the Funk the following year on November 1, 1994. Keepers of the Funk peaked at 47 on the Billboard 200 and featured three charting singles, the most successful of which was \"Tic Toc\". As stated in a 2013 interview, the group had never disbanded.\n\nThey reunited for a third album with 1999's Resurrection. Released via Queen Latifah's Jersey Kidz imprint, was so small-scale a release that few realized it had been recorded. The Lords returned again in 2007 for a fourth album entitled House of Lords, but like Resurrection, it failed to reach the Billboard charts.\n\nThe Lords are best remembered in connection with the golden age of hip hop. As such, when Nas decided in 2007 to do a remix of his song \"Where Are They Now?\", which asked of the fates of several long-forgotten golden age rappers, the Lords were among those requested to appear. DoItAll Dupré performed eight bars on the track.\n\nDoItAll appeared briefly in the final scene of the final episode of The Sopranos credited as Du Kelly, as one of a series of potentially ominous figures entering the diner. He also appeared on other TV shows; Law & Order as Two Tone, on Oz the HBO series, and on the Christmas episode of 30 Rock on NBC (2008). He has also been in independent movies such as Somewhere in the City with Bai Ling, Rhyme & Reason, and with Treach of Naughty By Nature. He has also starred in an off Broadway play entitled Diss, Diss, & Diss, Dat.\n\nIn 2017, DoItAll revealed he planned on running for Councilman at Large for his hometown of Newark.[1] He started his campaign in 2018, and despite not winning a seat still plans to help the city.[2]  <a href=\"https:\/\/www.last.fm\/music\/Lords+of+the+Underground\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":["Das EFX","Artifacts","Brand Nubian","Jeru the Damaja","KRS-One"]},{"nombre_artista":"Busta Flex","oyentes":"21942","reproducciones":"211224","bio":"Busta Flex is a French rapper. His influence is of many other French rappers. He has released 3 albums \"Busta Flex\", \"Sexe, Violence, Rap et Flouze\" and \"La Pièce Maîtresse\". He was born in Épinay-sur-Seine, Paris Region.\nHis 1 st album \"Busta Flex\" was recorded in 1998. <a href=\"https:\/\/www.last.fm\/music\/Busta+Flex\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":["Passi","Ärsenik","Fonky Family","Oxmo Puccino","IAM"]},{"nombre_artista":"Gravediggaz","oyentes":"314882","reproducciones":"4576229","bio":"Gravediggaz was an American hip-hop group from New York City, known for its dark sense of humor and abrasive, menacing soundscapes. Gravediggaz blended hardcore hip hop, gangsta rap and heavy metal with horror elements to pioneer the hip-hop subgenre of horrorcore.\n\nThe group was formed in 1992, bringing together Prince Paul (The Undertaker), Frukwan (The Gatekeeper), Poetic (The Grym Reaper) and RZA (The RZArector). It came about largely due to the efforts of Prince Paul. Frukwan and Prince Paul were previously together in the group Stetsasonic. According to Frukwan, the group's name means \"digging graves of the mentally dead, and it stood for resurrecting the mentally dead from their state of unawareness and ignorance.\" The group's lyrics mix black humor (regarding topics such as suicide, death, killing, psychopathy, hell, etc.), criticism regarding the music industry, cartoonish violence reminiscent of the Geto Boys, and esoteric references to the Nation of Gods and Earths. The group pioneered the horrorcore genre.\n\nThe group's first album was originally to be titled Niggamortis; however, this potentially risqué title was changed to 6 Feet Deep for the American market (European versions of the album retained the original title, and also included the bonus track \"Pass the Shovel\"); it was released on August 9, 1994. The four members adopted Gravedigga alter egos for their work with the group: RZA became The RZArector, Poetic became The Grym Reaper, Prince Paul became The Undertaker, and Frukwan became The Gatekeeper. In 1995, the three rapping members (without Prince Paul) released a collaborative EP titled \"The_Hell_E.P.\" with UK trip hop artist Tricky.\n\nThe second full-length Gravediggaz album The Pick, the Sickle and the Shovel was less humorous, dealing more with social and political issues; it also used calmer and more conventional production. Prince Paul played a considerably smaller role in the making of this album, with many of the production duties now taken care of by RZA and his Wu-Tang affiliates (including True Master and 4th Disciple).\n\nA bootleg Gravediggaz album surfaced in 1998, called Scenes From The Graveyard. It featured seven unreleased tracks plus some remixes from the first two albums.\n\nGravediggaz recruited DJ Diamond J. Poetic died of colon cancer in July 2001. Frukwan stated in an interview not long after Poetic's death that a new album using leftover Poetic material would be released. Nightmare in A-Minor, the third official album for Gravediggaz, came out in 2001; it featured two of the original members, Poetic and Frukwan. This album was their darkest work yet, including many references to Poetic's struggle with cancer, as well as apocalyptic themes to do with the teachings of the Five Percent Nation. Although RZA did not take part in the album, some Wu-Tang Clan affiliates such as 4th Disciple, True Master and Beretta 9 were involved. The album was mostly produced by Poetic and Frukwan. A different version of the album (minus the song \"Better Wake Up\") was released in 2002, for which some of the tracks created by Poetic were replaced or altered.\n\nIn 2003 Frukwan released his debut solo album, Life. The fourth Gravediggaz album 6 Feet Under was released in 2004 by Cleopatra Records and featured songs from Nightmare in A-Minor and Life. According to Frukwan, he had nothing to do with the release and claimed that song titles were changed without permission, making it an unauthorized release.\n\nIn 2010, Gravediggaz recorded a new song, \"2 More Cups of Blood\". In 2011, it was announced that the group had been recording new tracks involving Shabazz The Disciple & Killah Priest.\n\nIn 2018, Gatekeeper released \"1 Cup of Blood\" under the Gravediggaz name. <a href=\"https:\/\/www.last.fm\/music\/Gravediggaz\">Read more on Last.fm<\/a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply.","similares":["Ol' Dirty Bastard","GZA\/Genius","Wu-Tang Clan","Ghostface Killah","Organized Konfusion"]},{"nombre_artista":"Morau","oyentes":"63","reproducciones":"584","bio":"","similares":["Morau ta agotak","Zea Mays","Ruper Ordorika","Gose","Zarama"]}]